elements = [7,9,1,1,4]
#elements = [1,2,4,4,56, 12,100,1590,10002,1,56,3,2,1,66,78,24]
def solution(elements):
    answer = 0
    # 리스트로 하는경우 append는 가능할지 몰라도 add가 안먹힘 
    # add> 18 append > 7 한경우 답이 다르다 
    res = set()
    # 집합 자료형으로 선언 
    elements1 = elements * 2
    # elements를 그냥 코드로 짜면 가다가 중간에서 멈춰서 15라는값이 출력됨
    # len(elements) 보다 많은 값을 줘야하므로 
    # elemets1 = [7,9,1,1,4,7,9,1,1,4] 로 한다면 
    # 5번하는동안 끝까지만 간다면 하나씩하나씩되기때문 
    for i in range(len(elements)):
        for j in range(len(elements)):
            # 한번더 강조 set을 해야 add 함수형을 쓸수있다
            res.add(sum(elements1[j:j+i+1]))
            #{7}
            #{9, 7}
            #{9, 1, 7}
            #{9, 1, 7}
            #{9, 4, 1, 7}
            #{1, 4, 7, 9, 16}
            #{1, 4, 7, 9, 10, 16}
            #{1, 2, 4, 7, 9, 10, 16}
            #{1, 2, 4, 5, 7, 9, 10, 16}
            #{1, 2, 4, 5, 7, 9, 10, 11, 16}
            #{1, 2, 4, 5, 7, 9, 10, 11, 16, 17}
            #{1, 2, 4, 5, 7, 9, 10, 11, 16, 17}
            #{1, 2, 4, 5, 6, 7, 9, 10, 11, 16, 17}
            #{1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 16, 17}
            #{1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 16, 17, 20}
            #{1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 16, 17, 18, 20}
            #{1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 15, 16, 17, 18, 20}
            #{1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 13, 15, 16, 17, 18, 20}
            #{1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 13, 15, 16, 17, 18, 20, 21}
            #{1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 13, 15, 16, 17, 18, 20, 21}
            #{1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 13, 15, 16, 17, 18, 20, 21, 22}
            #{1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 13, 15, 16, 17, 18, 20, 21, 22}
            #{1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 13, 15, 16, 17, 18, 20, 21, 22}
            #{1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 13, 15, 16, 17, 18, 20, 21, 22}
            #{1, 2, 4, 5, 6, 7, 9, 10, 11, 12, 13, 15, 16, 17, 18, 20, 21, 22}
            answer = len(res) 
    
    # 초기 생각코드 
    #a = elements * 2 
    #res = []
    #사실 초기형 코드에서는 배열로 선언하고
    # 다갔다오면 되지않을까를 생각했음 
    #for i in range(len(elements)):
    #    for j in range(len(elements)):
    #        print(sum(a[i:j+i+1]))
    #        res.append(sum(a[i:i+j+1])) 
    # sorted를하고 결과를내면 몇몇 값이 없고 0이 있는 경우가 발생 
    #        print(len(set(res)))    
            # 틀린 접근 
    #        print(res)
    return answer